### Forest Calibnet Infrastructure  Plan: success

<details><summary>Show Plan</summary>

```
module.calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.calibnet.data.digitalocean_project.forest_project: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/12886492327922169494]
module.calibnet.digitalocean_droplet.forest: Refreshing state... [id=349090427]
module.calibnet.digitalocean_droplet.forest_observability: Refreshing state... [id=349090423]
module.calibnet.local_file.inventory: Refreshing state... [id=59683b3e84644e9890e6229969d31c076129949c]
module.calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=775546bd-1330-4588-81d7-7affd2a0d8e9]
module.calibnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=4ae9f4f8-ed9b-49a2-bb0c-c67eb0ee3567]
module.calibnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.calibnet.digitalocean_droplet.forest must be replaced
+/- resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-04-04T14:53:45Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "349090427" -> (known after apply)
      ~ ipv4_address         = "64.225.98.247" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.5" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-calibnet-iac"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          + "fa:48:60:7b:b0:c4:86:70:e9:fa:e9:f8:fb:c7:2e:72",
            # (22 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "calibnet",
        ]
      ~ urn                  = "do:droplet:349090427" -> (known after apply)
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.calibnet.digitalocean_droplet.forest_observability must be replaced
+/- resource "digitalocean_droplet" "forest_observability" {
      ~ created_at           = "2023-04-04T14:53:45Z" -> (known after apply)
      ~ disk                 = 160 -> (known after apply)
      ~ id                   = "349090423" -> (known after apply)
      ~ ipv4_address         = "167.172.96.73" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.4" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 8192 -> (known after apply)
        name                 = "forest-calibnet-observability"
      ~ price_hourly         = 0.07143 -> (known after apply)
      ~ price_monthly        = 48 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ ssh_keys             = [ # forces replacement
          + "fa:48:60:7b:b0:c4:86:70:e9:fa:e9:f8:fb:c7:2e:72",
            # (22 unchanged elements hidden)
        ]
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "calibnet",
        ]
      ~ urn                  = "do:droplet:349090423" -> (known after apply)
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.calibnet.digitalocean_firewall.forest_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_firewall" {
      ~ droplet_ids     = [
          - 349090427,
        ] -> (known after apply)
        id              = "775546bd-1330-4588-81d7-7affd2a0d8e9"
        name            = "forest-calibnet-iac"
        tags            = [
            "calibnet",
        ]
        # (3 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "6116" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 349090423,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      - inbound_rule {
          - port_range                = "9100" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 349090423,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      + inbound_rule {
          + port_range                = "6116"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }
      + inbound_rule {
          + port_range                = "9100"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

        # (5 unchanged blocks hidden)
    }

  # module.calibnet.digitalocean_firewall.forest_observability_firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest_observability_firewall" {
      ~ droplet_ids     = [
          - 349090423,
        ] -> (known after apply)
        id              = "4ae9f4f8-ed9b-49a2-bb0c-c67eb0ee3567"
        name            = "forest-calibnet-observability"
        tags            = [
            "calibnet",
        ]
        # (3 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "3100" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [] -> null
          - source_droplet_ids        = [
              - 349090427,
            ] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }
      + inbound_rule {
          + port_range                = "3100"
          + protocol                  = "tcp"
          + source_addresses          = []
          + source_droplet_ids        = (known after apply)
          + source_kubernetes_ids     = []
          + source_load_balancer_uids = []
          + source_tags               = []
        }

        # (6 unchanged blocks hidden)
    }

  # module.calibnet.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:349090423",
          - "do:droplet:349090427",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.calibnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_calibnet"
      + id                   = (known after apply)
    }

Plan: 3 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>